[
    {
        "head": "HIGHbrow",
        "image": "/assets/images/highBROW.png",
        "alt": "HIGHbrow",
        "toapp":"https://obscure-wildwood-73089.herokuapp.com/",
        "textapp": "HIGHbrow",
        "torepo":"https://github.com/AlvinZC4/HIGHbrow",
        "textrepo": "HIGHbrow Repo",
        "content": "HIGHbrow is a book regsitry application that is used to help user's gift other users books that want to read. Users can search for books to add to thier own wish list or they search for other users by e-mail to see their wish lists. This application was created using React.js and utilizes mongoDB to interact with users' accounts."
    },
    {
        "head": "Procasti-Dater",
        "image": "/assets/images/DinnerDate.png",
        "alt": "Procrasti-Dater",
        "toapp":"https://alvinzc4.github.io/Dinner-And-A-Movie/",
        "textapp": "Procasti-Dater",
        "torepo":"https://github.com/AlvinZC4/Dinner-And-A-Movie",
        "textrepo": "Procasti-Dater Repo",
        "content": "Procasti-Dater is an application that allows users to quickly set up a date on the fly by searching a specified location for a restaurant based on cuisine and events (such as concerts or shows). This app uses Integrated Google Geocode, Google Maps, Google Maps Places, & Ticketmaster API’s and manipulated the DOM with JavaScript by leveraging the DOM API."
    },
    {
        "head": "Employee Directory",
        "image": "/assets/images/EmployeeDirectory.png",
        "alt": "Employee Directory",
        "toapp": "https://alvinzc4.github.io/Employee-Directory/",
        "textapp": "Employee Directory",
        "torepo": "https://github.com/AlvinZC4/Employee-Directory",
        "textrepo": "Employee Directory Repo",
        "content": "The Employee Directory application makes an API call to get 50 random employees. The employees can be searched and sorted by first name or last name. This is a front-end application that was created using React.js and utilizes Axios as well as current React syntax such as useState and useEffect."
    },
    {
        "head": "Work Day Planner",
        "image": "/assets/images/DayPlanner.png",
        "alt": "Work Day Planner",
        "toapp": "https://alvinzc4.github.io/Work-Day-Scheduler/",
        "textapp": "Work Day Planner",
        "torepo": "https://github.com/AlvinZC4/Work-Day-Scheduler",
        "textrepo": "Work Day Planner Repo",
        "content": "The Work Day Planner is a daily event calendar that breaks each day down by the hour for every hour of the typical work day (8am - 5pm) and allows the user to create and save events for each hour. The application displays the current day and time and dynamically updates the display of the calendar based on the current time. This application makes use of Moment.js and LocalStorage."
    },
    {
        "head": "Eat-Da-Burger",
        "image": "/assets/images/BurgerApp.png",
        "alt": "Eat-Da-Burger",
        "toapp": "https://shrouded-journey-36823.herokuapp.com/",
        "textapp": "Eat-Da-Burger",
        "torepo": "https://github.com/AlvinZC4/Eat-da-Burger",
        "textrepo": "Eat-Da-Burger Repo",
        "content": "Eat-Da-Burger is an application that allows the user to create as many burgers as they like and then devour them. This application uses a MySQL database along with three of the four CRUD operations to Get, Post, and Put the user created burgers. The application was created with the MCV model and utilizes Handlebars.js to render data returned from the database."
    },
    {
        "head": "Note Taker",
        "image": "/assets/images/NoteTaker.png",
        "alt": "Note Taker",
        "toapp": "https://protected-lake-56546.herokuapp.com/",
        "textapp": "Note Taker",
        "torepo": "https://github.com/AlvinZC4/Note-Taker",
        "textrepo": "Note Taker Repo",
        "content": "The Note Taker application allows the user to create, store, and delete notes to help the user keep track of their tasks and thoughts. This application uses Express.js to create an API and handle the routing that allows the user to GET, POST, & DELETE their notes."
    },
    {
        "head": "Budget Tracker",
        "image": "/assets/images/Budget.png",
        "alt": "Budget Tracker",
        "toapp": "https://salty-garden-64216.herokuapp.com/",
        "textapp": "Budget Tracker",
        "torepo": "https://github.com/AlvinZC4/Budget-Tracker",
        "textrepo": "Budget Tracker Repo",
        "content": "The Budget Tracker helps users keep track of their account by letting them enter any deposits or expenditures into the application and shows their current balance. This is a progressive web application; the user can download the app to their local machine and if the user loses their internet connection the app will keep cache all changes to be made to the database until the internet connection is reestablished and the database can be updated."
    }
]